# ICustomFieldProperties Interface

---
Represents the base class for the properties of a custom field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public interface ICustomFieldProperties

    Public Interface ICustomFieldProperties

    public interface class ICustomFieldProperties

    type ICustomFieldProperties = interface end
The ICustomFieldProperties type exposes the following members.
| Name| Description
---|---|---
| AreEqualTo|  Identifies if the custom field properties are equal or not.
Top
#### Reference
Autodesk.Revit.DB Namespace